<!DOCTYPE html>
<html>
  <head>
    <meta charset="UTF-8" />
    <title>Infenix</title>
    <link rel="stylesheet" href="../styles/main.css" />
    <link rel="stylesheet" href="../styles/project.css" />
    <link rel="shortcut icon" href="../images/logos/favicon.ico" type="image/x-icon" />
  </head>
  <body>
    <div class="flex-wrapper">
      <header>
        <nav>
          <ul>
            <li class="logo">
              <a href="index.html"> <img src="../images/logos/Infenix.png" /></a>
            </li>
            <li class="underline">
              <a href="index.html">Accueil</a>
            </li>
            <li class="current">
              <a href="#">Jeux</a>
            </li>
            <li class="underline">
              <a href="projects.html">Projets</a>
            </li>
            <li class="underline">
              <a href="about.html">&#193; propos</a>
            </li>
          </ul>
          <div class="lang">
            <ul>
              <li class="underline notCurrentLang">
                <a href="../games.html">EN</a>
              </li>
              <li>
                <a href="#">FR</a>
              </li>
            </ul>
          </div>
        </nav>
      </header>

      <div class="projects">
        <h1>Jeux</h1>

        <section class="project">
          <h2>Stellaris: Astral Planes (2023)</h2>
          <iframe class="splash" width="560" height="315" src="https://www.youtube-nocookie.com/embed/O544CkFV5ck" frameborder="0" allowfullscreen></iframe>
          <p class="subtitle">Trailer de lancement de Stellaris: Astral Planes</p>
          <p class="explanation">
            Stellaris: Astral Planes est un DLC pour le jeu 4X de science fiction Stellaris (2016) développé par
            <a href="https://www.abrakam.com/" target="_blank" class="credit">Abrakam Entertainment</a> en tant que projet externalisé en collaboration avec
            <a href="https://www.paradoxinteractive.com/" target="_blank" class="credit">Paradox Interactive</a>, pour lequel Abrakam avait un haut niveau
            contrôle. On entend par celà le contrôle du design et de l'implémentation du début à la fin, avec en parallèle l'aide de Paradox tout au long du
            développement nous donnant leurs conseils et leur aide dès que nécessaire. Ils étaient aussi en charge d'avoir le dernier mot, validant ce qui
            allait dans le DLC et ce qui devait être retravaillé s'ils l'estimaient nécessaire.
          </p>
          <p class="explanation">
            Ce projet a été développé sur une année, commençant en Octobre 2022 pour une sortie en Novembre 2023. C'est le premier projet professionel sur
            lequel j'aurais eu l'occasion de travailler dessus du début à la fin. Pendant ce temps, j'ai eu l'occasion de travailler sur de nombreuses facettes
            du projet, incluant le gameplay, la UI et les graphismes. Ce projet tourne dans le moteur propriétaire de Paradox, Clausewitz, qui utilise le C++
            pour gérer les systèmes, ainsi qu'un language de script interne chargé du contenu.
          </p>
          <div class="project-links">
            <ul>
              <li>
                <a href="https://www.paradoxinteractive.com/games/stellaris/about" class="box-link" target="_blank"> Site du jeu </a>
              </li>
              <li>
                <a href="https://store.steampowered.com/app/2534090/Stellaris_Astral_Planes/" class="box-link" target="_blank"> Page Steam </a>
              </li>
            </ul>
          </div>
        </section>

        <section class="project">
          <h2>Roguebook (2021)</h2>
          <iframe class="splash" width="560" height="315" src="https://www.youtube-nocookie.com/embed/sDHD5Kv_C3U" frameborder="0" allowfullscreen></iframe>
          <p class="subtitle">Trailer de lancement</p>
          <p class="explanation">
            Roguebook est le premier jeu sur lequel j'ai travaillé dans un cadre professionel. Développé par le studio belge
            <a href="https://www.abrakam.com/" target="_blank" class="credit">Abrakam Entertainment</a>, c'est là que j'ai effectué mon stage de fin d'études.
            J'ai commencé par apporter de l'aide sur le développement du jeu en faisant principalement du bug fixing. Cependant, c'est sur le portage console du
            jeu que j'ai passé la plupart de mon temps, notamment sur les Playstation 4, Playstation 5, Xbox One et Xbox Series.
          </p>
          <p class="explanation">
            Durant ce temps, j'ai eu l'occasion de travailler sur l'implémentation des SDKs de ces consoles pour faire tourner le jeu sur ces plateformes. J'ai
            aussi travaillé sur les TRCs (Technical Requirement Checklist) et les contraintes apportées par celle-ci nécessitant parfois l'ajout de
            fonctionnalités non prévues par l'architecture initiale et qu'il faut alors adapter ou contourner. Le projet est séparé en deux parties principales.
            Le client tourne sous Unity en C#, mais une partie du gameplay est contrôlée par un serveur local développé en C++. Ces deux projets nécessitent
            d'être portés pour permettre au jeu de fonctionner correctement.
          </p>
          <div class="project-links">
            <ul>
              <li>
                <a href="https://roguebook.net" class="box-link" target="_blank"> Site du jeu </a>
              </li>
              <li>
                <a href="https://store.steampowered.com/app/1076200/Roguebook/" class="box-link" target="_blank"> Page Steam </a>
              </li>
            </ul>
          </div>
        </section>

        <section class="project">
          <h2>Humankind's Fall (2021)</h2>
          <iframe class="splash" width="560" height="315" src="https://www.youtube-nocookie.com/embed/PzOO0h36xIc" frameborder="0" allowfullscreen></iframe>
          <p class="subtitle">Trailer du jeu</p>
          <p class="explanation">
            Humankind's Fall a &#233;t&#233; r&#233;alis&#233; dans le cadre du cours de Laboratoire de Jeux Vid&#233;o &#224; l'UQAC. C'est un autochess 2D
            avec comme particularit&#233; de n'être jouable qu'en solo. Le but est de vaincre les humains afin de mettre un terme au chaos qu'ils ont
            apport&#233; en faisant tomber la capitale, Vermont. Six personnes ont travaill&#233; sur sa cr&#233;ation. Les assets graphiques proviennent de
            packs pr&#233;faits. Le jeu a &#233;t&#233; r&#233;alis&#233; sous Unity en quatre mois. Vous pouvez apprécier mon incroyable doublage dans la
            bande-annonce.
          </p>
          <div class="project-links">
            <ul>
              <li>
                <a href="https://github.com/ImInfenix/HumankindsFall" class="box-link" target="_blank"> D&#233;p&#244;t Github </a>
              </li>
              <li>
                <a href="https://infenix.itch.io/humankinds-fall" class="box-link" target="_blank"> Page de t&#233;l&#233;chargement </a>
              </li>
            </ul>
          </div>
        </section>

        <section class="project">
          <h2>The Never Too Late Program (2021)</h2>
          <img class="splash" src="https://img.itch.zone/aW1hZ2UvODk0Njk5LzUwODEwOTcucG5n/347x500/nCes%2BY.png" />
          <p class="subtitle">Une usine o&#249; le joueur transporte des objets</p>
          <p class="explanation">
            The Never Too late Program a &#233;t&#233; cr&#233;&#233; pour la Blackthornprod Jam 3, qui avait pour th&#232;me "Less is More" (Moins est Plus).
            Dans ce jeu, vous travaillez dans une usine o&#249; vous devez transporter des objets d'un point &#225; un autre. Chaque jour, vous devez remplir
            votre quotas, mais attention ! Si vous allez trop vite, vous recevrez de nouvelles t&#226;ches ce qui risque de vous emp&#234;cher d'atteindre le
            but. Les sons et musiques ont &#233;t&#233; cr&#233;&#233;s par
            <a href="https://www.youtube.com/channel/UCwBJVl_ECknSXtEb9CqC_LQ" target="_blank" class="credit">Pierre Bédue</a>. Ce jeu a &#233;t&#233;
            cr&#233;&#233; en utilisant Unity, Blender, Aseprite, Cubase et Audacity.
          </p>
          <div class="project-links">
            <ul>
              <li>
                <a href="https://github.com/ImInfenix/The-Never-Too-Late-Program" class="box-link" target="_blank"> D&#233;p&#244;t Github </a>
              </li>
              <li>
                <a href="https://infenix.itch.io/the-never-too-late-program" class="box-link" target="_blank"> Jouer dans le navigateur </a>
              </li>
            </ul>
          </div>
        </section>

        <section class="project">
          <h2>When I Grow Up (2021)</h2>
          <img class="splash" src="https://img.itch.zone/aW1nLzQ5Nzg0MDUucG5n/315x250%23c/pMegiZ.png" />
          <p class="subtitle">The game's character</p>
          <p class="explanation">
            When I Grow Up est un jeu d'une dur&#233;e de une minute o&#249; un petit personnage grandit en trouvant des &#233;l&#233;ments de son corps. Il a
            &#233;t&#233; r&#233;alis&#233; pour la Weekly Game Jam 183 dont le th&#232;me &#233;tait "Build a Creature" (Construire une Cr&#233;ature). J'ai
            particuli&#232;rement appr&#233;ci&#233; le cr&#233;er mais je n'ai pas eu beaucoup de temps pour travailler dessus, ce qui en fait le jeu le plus
            cours que j'ai cr&#233;&#233;. Ce jeu a &#233;t&#233; cr&#233;&#233; en utilisant Unity, Blender and FL Studio.
          </p>
          <div class="project-links">
            <ul>
              <li>
                <a href="https://infenix.itch.io/when-i-grow-up" class="box-link" target="_blank"> Jouer dans le navigateur </a>
              </li>
            </ul>
          </div>
        </section>

        <section class="project">
          <h2>Tower Forge (2020)</h2>
          <img class="splash" src="https://img.itch.zone/aW1hZ2UvODAyNjcwLzQ0OTU2NjcucG5n/original/%2BtNzsd.png" />
          <p class="subtitle">Les aliens essayent d'envahir la forteresse naine</p>
          <p class="explanation">
            Tower Forge est un tower defense que j'ai cr&#233;&#233; en collaboration avec
            <a href="https://www.artstation.com/tnoucca" target="_blank" class="credit">Johan Poncet</a>. Dans Tower Forge, vous jouez des nains qui defendent
            leur cité face &#224; une invasion alienne. Ce jeu se distingue d'autres towers defenses en proposant au joueur de construire des tours comme il le
            d&#233;sire, en choisissant une combinaison de base/tour pour chacune des tours construites. C'est en effet au joueur de choisir quel
            &#233;l&#233;ment synergisera bien avec les autres pour s'assurer qu'aucun alien ne passera les défenses. La musique est de
            <a href="https://www.youtube.com/channel/UCwBJVl_ECknSXtEb9CqC_LQ" target="_blank" class="credit">Pierre Bédue</a>. Ce jeu a &#233;t&#233;
            cr&#233;&#233; en utilisant Unity, Photoshop, Cubase and Audacity.
          </p>
          <div class="project-links">
            <ul>
              <li>
                <a href="https://github.com/ImInfenix/TowerForge" class="box-link" target="_blank"> D&#233;p&#244;t Github </a>
              </li>
              <li>
                <a href="https://infenix.itch.io/tower-forge" class="box-link" target="_blank"> Page de t&#233;l&#233;chargement </a>
              </li>
            </ul>
          </div>
        </section>

        <section class="project">
          <h2>Color Race (2020)</h2>
          <img class="splash" src="https://play-lh.googleusercontent.com/eCelWdgoyvkbOSWjHrwte7fl7C-iJnOjRdnSO1jj9YHhO56zMbq1Ofszr66ulf17rg=w720-h310-rw" />
          <p class="subtitle">Changer sa couleur pour passer les obstacles</p>
          <p class="explanation">
            Color Race est un jeu d'arcade d&#233;velopp&#233; pour mobiles o&#249; le joueur doit passer des obstacles color&#233;s. Le seul moyen de survivre
            est de ne toucher aucun obstacle, &#224; moins que la couleur du joueur soit la m&#234;me que celle de l'obstacle. Le but du jeu &#232;tait pour
            moi, en tant que d&#233;veloppeur, d'apprendre &#224; publier un jeu sur une plateforme d&#233;di&#233;e et comment int&#233;grer des pubs. Color
            Race a &#233;t&#233; cr&#233;&#233; en utilisant Unity, Photoshop, FL Studio and Audacity.
          </p>
          <div class="project-links">
            <ul>
              <li>
                <a href="https://play.google.com/store/apps/details?id=com.Infenix.ColorRace" class="box-link" target="_blank">
                  Page de t&#233;l&#233;chargement
                </a>
              </li>
            </ul>
          </div>
        </section>

        <section class="project">
          <h2>2045 (2020)</h2>
          <img class="splash" src="../images/games/2045.png" />
          <p class="subtitle">&#201;chapper aux lumi&#232;res pour retrouver sa libert&#233;</p>
          <p class="explanation">
            En Janvier 2020 a &#233;t&#233; organis&#233;e la deuxi&#232;me Game Jam de l'ESIR (mon &#233;cole d'ing&#233;nieur). Le th&#232;me de cette Gam Jam
            &#233;tait "Safe In The Dark" (En s&#233;curit&#233; en le noir). Avec mon groupe de quatre personnes dont un autre programmeur, nous avons
            d&#233;cid&#233; de faire un jeu multijoueur local o&#249; le premier joueur cherche &#224; s'&#233;chapper d'une prison. Le deuxi&#232;me joueur
            doit l'aider &#224; remplir son but apr&#232;s &#234;tre devenu "Shadow", une entit&#233;e capable de cacher d&#233;sactiver toute source de
            lumi&#232;re et de les d&#233;sactiver. 2045 a &#233;t&#233; r&#233;alis&#233; en 35 heures en utilisant Unity, Photoshop et Audacity.
          </p>
          <div class="project-links">
            <ul>
              <li>
                <a href="https://docs.google.com/uc?export=download&id=1fbcEARiacpJeW2hnjj5890TgbbVsTpcL" class="box-link" target="_blank">
                  T&#233;l&#233;chargement direct
                </a>
              </li>
            </ul>
          </div>
        </section>

        <section class="project">
          <h2>Pop-Up Run (2019)</h2>
          <img class="splash" src="https://img.itch.zone/aW1nLzIwMzc0NjUucG5n/347x500/FIQSdF.png" />
          <p class="subtitle">Un voyage dans la ville de l'Internet</p>
          <p class="explanation">
            Pop-Up run &#233;tait mon projet pour la GDA Jam en 2019 avec une &#233;quipe de quatre personnes. Le th&#232;me &#233;tait "No Signal" (Pas de
            signal). J'&#233;tais sur ce projet le seul programmeur avec une &#233;quipe de trois &#233;tudiants en art digital. Dans Pop-Up run, vous devez
            trouver votre voie &#224; travers l'Internet dans un gameplay de type runner tout en devant fermer des pubs s'affichant en continu et couvrant
            l'&#233;cran. Mais attention ! Si vous cliquez sur une pub au lieu de la fermer, cela en fera appara&#238;tre d'autres. Ce jeu a &#233;t&#233;
            cr&#233;&#233; en utilisant Unity, Photoshop, 3DS Max and Audacity.
          </p>
          <div class="project-links">
            <ul>
              <li>
                <a href="https://tnoucca.itch.io/pop-up-run" class="box-link" target="_blank"> Page de t&#233;l&#233;chargement </a>
              </li>
              <li>
                <a href="https://docs.google.com/uc?export=download&id=1HLU11bF3MRzUeVMoATFq-h_DA18xkodi" class="box-link" target="_blank">
                  T&#233;l&#233;chargement (Build optimis&#233;)
                </a>
              </li>
            </ul>
          </div>
        </section>
        <section class="project">
          <h2>Snake (2019)</h2>
          <img class="splash" src="../images/games/Snake.png" />
          <p class="subtitle">Une production originale</p>
          <p class="explanation">
            Ceci est ma propre version du c&#233;l&#232;bre jeu "Snake" ainsi que mon premier jeu cr&#233;&#233; sous Unity en dehors de tutoriels. Cela m'a
            beaucoup appris sur comment utiliser Unity, ce que le moteur de jeu &#233;tait capable de faire, et pourquoi je devais en utiliser un.
          </p>
          <div class="project-links">
            <ul>
              <li>
                <a href="https://docs.google.com/uc?export=download&id=1sItAd8uw7JXlX9wQ0_XTZ8mQdvUCy2x8" class="box-link" target="_blank">
                  T&#233;l&#233;chargement direct
                </a>
              </li>
            </ul>
          </div>
        </section>
      </div>

      <footer>
        <nav>
          <ul>
            <li>
              <a href="https://github.com/ImInfenix" target="_blank">
                <img src="../images/logos/GitHub-Mark-Light-64px.png" />
              </a>
            </li>
            <li>
              <a href="https://infenix.itch.io/" target="_blank">
                <img src="../images/logos/itchio-textless-white.svg" />
              </a>
            </li>
            <li>
              <a href="https://www.linkedin.com/in/duncan-sourdin/" target="_blank">
                <img src="../images/logos/In-White-48.png" />
              </a>
            </li>
          </ul>
        </nav>
      </footer>
    </div>
  </body>
</html>
